In [1]:
#joining
import pandas as pd
import numpy as np
left = pd.DataFrame({'A' : ['A0', 'A1', 'A2'],
                     'B' : ['B0', 'B1', 'B2']},
                     index = ['K0', 'K1', 'K2'])

right = pd.DataFrame({'C' : ['C0', 'C1', 'C3'],
                      'D' : ['D0', 'D2', 'D3']},
                      index = ['K0', 'K2', 'K3'])

In [2]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [3]:
right

     C   D
K0  C0  D0
K2  C1  D2
K3  C3  D3

In [4]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D2

In [5]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D2   A2   B2
K3  C3  D3  NaN  NaN

In [6]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D2
K3  NaN  NaN   C3   D3

In [7]:
#operations
df = pd.DataFrame({'col1' : [1, 2, 3, 4], 'col2' : [444, 555, 666, 444], 'col3' : ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [9]:
df['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [10]:
df['col2'].nunique()

3

In [11]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [12]:
df['col1'].sum()

10

In [13]:
def times2(x):
    return x**2

In [14]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [15]:
df['col1'].apply(lambda x : x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [16]:
#selecting data
newdf = df[(df['col1']>2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [17]:
del df['col1']

In [18]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [19]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [20]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [21]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [22]:
df.isnull().sum()

col2    0
col3    0
dtype: int64

In [23]:
#pivot table
df = pd.read_excel('weather.xlsx')
df

        date      city  temperature   humidity
0 2017-01-05  new york            65        56
1 2017-02-05  new york            66        58
2 2017-03-05  new york            68        60
3 2017-01-05    mumbai            75        80
4 2017-02-05    mumbai            78        83
5 2017-03-05    mumbai            82        85
6 2017-01-05   beijing            80        26
7 2017-02-05   beijing            77        30
8 2017-03-05   beijing            79        35

In [24]:
df.pivot(index = 'city', columns = 'date')

         temperature                          humidity
date       2017-01-05 2017-02-05 2017-03-05 2017-01-05 2017-02-05 2017-03-05
city
beijing            80         77         79         26         30         35
mumbai             75         78         82         80         83         85
new york           65         66         68         56         58         60

In [25]:
df.pivot(index = 'city', columns = 'date', values = 'humidity')

date      2017-01-05  2017-02-05  2017-03-05
city
beijing           26          30          35
mumbai            80          83          85
new york          56          58          60

In [26]:
df.pivot_table(index = "city", columns = "date", margins = True, aggfunc = np.sum)

C:\Users\User\AppData\Local\Temp\ipykernel_8564\187316439.py:1: FutureWarning: The provided callable <function sum at 0x000002344C0BB9C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(index = "city", columns = "date", margins = True, aggfunc = np.sum)
C:\Users\User\AppData\Local\Temp\ipykernel_8564\187316439.py:1: FutureWarning: The provided callable <function sum at 0x000002344C0BB9C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(index = "city", columns = "date", margins = True, aggfunc = np.sum)
C:\Users\User\AppData\Local\Temp\ipykernel_8564\187316439.py:1: FutureWarning: The provided callable <function sum at 0x000002344C0BB9C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(index = "city", columns = "date", margins = True, aggfunc = np.sum)

                    humidity                                               \
date     2017-01-05 00:00:00 2017-02-05 00:00:00 2017-03-05 00:00:00  All
city
beijing                   26                  30                  35   91
mumbai                    80                  83                  85  248
new york                  56                  58                  60  174
All                      162                 171                 180  513

                temperature
date     2017-01-05 00:00:00 2017-02-05 00:00:00 2017-03-05 00:00:00  All
city
beijing                   80                  77                  79  236
mumbai                    75                  78                  82  235
new york                  65                  66                  68  199
All                      220                 221                 229  670

In [27]:
#Grouper
df.pivot_table(index = pd.Grouper(freq = 'M', key = 'date'), columns = 'city')

C:\Users\User\AppData\Local\Temp\ipykernel_8564\846881393.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df.pivot_table(index = pd.Grouper(freq = 'M', key = 'date'), columns = 'city')

           humidity                 temperature
city        beijing mumbai new york      beijing mumbai new york
date
2017-01-31     26.0   80.0     56.0         80.0   75.0     65.0
2017-02-28     30.0   83.0     58.0         77.0   78.0     66.0
2017-03-31     35.0   85.0     60.0         79.0   82.0     68.0